# SetMrEm2DCompByStyle

## Description
```pascal
FUNCTION SetMrEm2DCompByStyle(
				hObject : HANDLE;
				byStyle : BOOLEAN) : BOOLEAN;
```

```python

def vs.SetMrEm2DCompByStyle(hObject, byStyle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|byStyle|BOOLEAN||

## Version
Availability: from Vectorworks 2020
## Category
* Objects - Custom